_posts/2016-11-06-django-note.html
---
layout: post
title: Django小笔记
categories: computers
tags: Python Django
excerpt: A compilation of notes related to Django framework
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Django Notes</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">General</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Chinese support
<ul class="org-ul">
<li>language code in settings.py
</li>
<li>utf-8 coding in any .py
</li>
<li>encoding header in html templates
</li>
</ul>
</li>

<li>use django models in scrapy projects:
<div class="org-src-container">

<pre class="src src-python"><span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>  <span class="org-keyword">def</span> <span class="org-function-name">setup_django_env</span>(path):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">import</span> imp, os
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">from</span> django.core.management <span class="org-keyword">import</span> setup_environ

<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">f</span>, <span class="org-variable-name">filename</span>, <span class="org-variable-name">desc</span> = imp.find_module(<span class="org-string">'settings'</span>, [path])
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">project</span> = imp.load_module(<span class="org-string">'settings'</span>, f, filename, desc)       

<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   setup_environ(project)

<span class="org-comment-delimiter"># </span><span class="org-comment">Add django project to sys.path</span>
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">import</span> sys
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   sys.path.append(os.path.abspath(os.path.join(path, os.path.pardir)))

setup_django_env(<span class="org-string">'/home/zhichu/Projects/trip_proj/trip_proj/gotrip/gotrip/'</span>)
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Model/Form/Query</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>. <code>.filter</code> returns a queryset, i.e. you need to do a forloop to get individual instances
</li>
<li><code>verbose_name</code> will be overriden if formfield is re-defined in forms.py; use <code>label</code> for form field instead
<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">ItineraryForm</span>(ModelForm):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>  <span class="org-variable-name">start_date</span> = forms.DateField((<span class="org-string">'%Y/%m/%d'</span>,), label = u<span class="org-string">'checkin_date'</span>, widget = forms.DateTimeInput(<span class="org-builtin">format</span>=<span class="org-string">'%Y/%m/%d'</span>, attrs={
           <span class="org-string">'class'</span>:<span class="org-string">'input'</span>,
           <span class="org-string">'size'</span>:<span class="org-string">'10'</span>
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>  }))
</pre>
</div>
</li>
<li>date format should match between jquery widget and formfield setting
</li>
<li>for using <code>contenttype</code>, see my SO question <a href="http://stackoverflow.com/questions/12782847/django-using-contenttype-vs-multi-table-inheritance">  Django: using ContentType vs multi table inheritance</a> and <code>trip/models.py</code> and <code>trip/views.py</code>
<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">hotelstay_ctype</span> = ContentType.objects.get_for_model(HotelStay)
<span class="org-variable-name">trip_event_list</span> = TripEvent.objects.<span class="org-builtin">filter</span>(content_type=hotelstay_ctype)
<span class="org-keyword">for</span> trip_event <span class="org-keyword">in</span> trip_event_list:
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">print</span> trip_event.content_object.checkin_date
</pre>
</div>
</li>
<li>filter objects by date:
<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">queryset</span>=Itinerary.objects.<span class="org-builtin">filter</span>(end_date__lt=date.today())
</pre>
</div>
</li>
<li>filter ModelForm's ForeignKey field during initialization, by passing <code>user=request.user</code> through <code>*kwargs</code> to form's <code>__init__()</code> method:
<div class="org-src-container">

<pre class="src src-python"><span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>  <span class="org-comment-delimiter"># </span><span class="org-comment">in forms.py</span>
<span class="org-keyword">class</span> <span class="org-type">HotelStayForm</span>(ModelForm):
...
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, *args, **kwargs): <span class="org-comment-delimiter">#</span><span class="org-comment">set initial value for field itinerary</span>
        <span class="org-variable-name">user</span> = kwargs.pop(<span class="org-string">'user'</span>, <span class="org-string">''</span>)
        <span class="org-builtin">super</span>(HotelStayForm, <span class="org-keyword">self</span>).__init__(*args, **kwargs)
        <span class="org-comment-delimiter"># </span><span class="org-comment">only show itineraries belonging to request.user</span>
        <span class="org-keyword">self</span>.fields[<span class="org-string">'itinerary'</span>]<span class="org-variable-name">.queryset</span> = Itinerary.objects.<span class="org-builtin">filter</span>(user=user)
<span class="org-comment-delimiter"># </span><span class="org-comment">in views.py</span>
<span class="org-type">@login_required</span>()
<span class="org-keyword">def</span> <span class="org-function-name">add_hotelstay</span>(request):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">if</span> request.method == <span class="org-string">'POST'</span>: <span class="org-comment-delimiter"># </span><span class="org-comment">If the form has been submitted...</span>
        <span class="org-variable-name">form</span> = HotelStayForm(request.POST, user=request.user) <span class="org-comment-delimiter"># </span><span class="org-comment">A form bound to the POST data</span>
        <span class="org-keyword">if</span> form.is_valid(): <span class="org-comment-delimiter"># </span><span class="org-comment">All validation rules pass</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">Process the data in form.cleaned_data</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">...</span>
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">else</span>:
        <span class="org-variable-name">form</span> = HotelStayForm(user=request.user) <span class="org-comment-delimiter"># </span><span class="org-comment">user kwargs used in form to set initial value for itinerary field</span>
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">return</span> render_to_response(<span class="org-string">'trip/add_itinerary.html'</span>, {
        <span class="org-string">'form'</span>: form}, context_instance=RequestContext(request)
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   )
</pre>
</div>
</li>
<li>attaching multiple models to a model, and show them in admin site, see this <a href="http://stackoverflow.com/questions/537593/multiple-images-per-model">http://stackoverflow.com/questions/537593/multiple-images-per-model</a>
</li>
<li>aggregate over reverse relationship and sort by aggregated value
</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">st_count</span>=TrainStationDetail.objects.<span class="org-builtin">all</span>().annotate(line_count=Count(<span class="org-string">'trainlinedetail'</span>)).order_by(<span class="org-string">'-line_count'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">View/Template</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>passing variables from templates to callable methods is bad for security/maintainability; use <code>template tags</code> instead 
</li>
<li>use <code>reverse_lazy()</code> instead of <code>reverse()</code> for <code>success_url</code> in generic views
</li>
<li>to use message in generic views, override <code>form_valid()</code> method
</li>
<li>override <code>get_queryset()</code> to check object ownership
</li>
<li><code>decorator</code> can be added to <code>urlConf</code> or <code>dispatch</code> method for generic views
</li>
<li>use multiple submit buttons:
<div class="org-src-container">

<pre class="src src-html">&lt;<span class="org-function-name">input</span> <span class="org-variable-name">class</span>=<span class="org-string">"button"</span> <span class="org-variable-name">type</span>=<span class="org-string">"submit"</span> <span class="org-variable-name">name</span>=<span class="org-string">"_delete"</span> <span class="org-variable-name">value</span>=<span class="org-string">"finish"</span>&gt;     
 &lt;<span class="org-function-name">input</span> <span class="org-variable-name">class</span>=<span class="org-string">"button"</span> <span class="org-variable-name">type</span>=<span class="org-string">"submit"</span> <span class="org-variable-name">name</span>=<span class="org-string">"_back"</span> <span class="org-variable-name">value</span>=<span class="org-string">"don't delete"</span>&gt;        
       if '_back' in self.request.POST:
</pre>
</div>
</li>
<li>To update RequestContext(request) with extra context,
<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">context</span> = RequestContext(request)
context.update({<span class="org-string">'friend_list'</span>:friend_list})
</pre>
</div>
<p>
see this SO question <a href="http://stackoverflow.com/questions/38987/how-can-i-merge-union-two-python-dictionaries-in-a-single-expression">concatenate two dict</a> for some related discussion.
</p>
</li>
<li>chaining template filters
<div class="org-src-container">

<pre class="src src-python">{{value|filter1:arg1|filter2:arg2}}
</pre>
</div>
</li>
<li>showing localtime in template
</li>
</ol>
<div class="org-src-container">

<pre class="src src-html">{{datetime|time}} // gets localtime
{{datetime.time}} // gets utc time
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Test</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Simulating user login in a unittest
<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">from</span> django.contrib.auth.models <span class="org-keyword">import</span> User
<span class="org-keyword">from</span> django.test <span class="org-keyword">import</span> TestCase
<span class="org-keyword">from</span> django.test.client <span class="org-keyword">import</span> Client

<span class="org-keyword">class</span> <span class="org-type">TripTestCase</span>(TestCase):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">def</span> <span class="org-function-name">setUp</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.client = Client()
        <span class="org-keyword">self</span>.test_user = User.objects.create_user(<span class="org-string">'testuser'</span>, <span class="org-string">'test@test.com'</span>, <span class="org-string">'password'</span>)

<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">def</span> <span class="org-function-name">user_login</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.client.login(username=<span class="org-string">'testuser'</span>, password=<span class="org-string">'password'</span>)

<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">def</span> <span class="org-function-name">tearDown</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.test_user.delete()


<span class="org-keyword">class</span> <span class="org-type">SimpleTest</span>(TripTestCase):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">def</span> <span class="org-function-name">test_list_itinerary_view</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.user_login()
        <span class="org-variable-name">resp</span> = <span class="org-keyword">self</span>.client.get(<span class="org-string">'/trip/list_itinerary/'</span>)
        <span class="org-keyword">self</span>.assertEqual(resp.status_code, 200)
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Celery</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li><code>pytz</code> needs to be installed to use celery beat
</li>
<li>run periodic background tasks:
<div class="org-src-container">

<pre class="src src-sh">./manage.py celery beat --loglevel=INFO
</pre>
</div>
<p>
run worker:
</p>
<div class="org-src-container">

<pre class="src src-sh">./manage.py celery worker
</pre>
</div>
<p>
using custom logging 
</p>
<div class="org-src-container">

<pre class="src src-sh">-l INFO -f worker.log
</pre>
</div>
<p>
(using custom logging in celery seems very hard, if not using some nasty hack. Currently using celery-provided logging. The only complaint is worker.log gets DEBUG-level messages from MainProcess. Will look for a better logging solution in the future.)
</p>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">south</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>use south to migrate data after adding a field to a model:
<ul class="org-ul">
<li>before changing the model,
<div class="org-src-container">

<pre class="src src-sh">./manage.py schemamigration &lt;appname&gt;
</pre>
</div>
</li>
<li>after changing the model,
<div class="org-src-container">

<pre class="src src-sh">./manage.py schemamigration &lt;appname&gt;;
./manage.py migrate &lt;appname&gt;
</pre>
</div>
</li>
</ul>
</li>
<li>for a legacy app, run
<div class="org-src-container">

<pre class="src src-sh">./manage.py convert_to_south &lt;appname&gt;
</pre>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">tastypie</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>See this <a href="http://stackoverflow.com/questions/9468902/toggle-fields-to-be-full-in-the-url-for-tastypie">SO thread</a> for methods to toggle 'full' through url 
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">deployment</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>uwsgi+nginx: 
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install nginx
apt-get install build-essential python-dev libxml2-dev <span class="org-comment-delimiter"># </span><span class="org-comment">uwsgi dependency</span>
pip install uwsgi
bin/uwsgi --socket /tmp/uwsgi.sock --wsgi-file /mnt/scratch/test.py --chmod-socket=666
<span class="org-comment-delimiter"># </span><span class="org-comment">serve django</span>
bin/uwsgi --socket /tmp/uwsgi.sock --chdir /mnt/scratch/testapp/testdeploy/ --wsgi-file /mnt/scratch/testapp/testdeploy/testdeploy/wsgi.py  --virtualenv /usr/virtualenv --chmod-socket=666
</pre>
</div>
</li>

<li>verify nginx conf file:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-sh">/usr/sbin/nginx -t -c conf_name.conf
</pre>
</div>

<ol class="org-ol">
<li>uwsgi configurations
<ul class="org-ul">
<li>use <code>master=true</code> and <code>pidfile</code> for easier management, e.g.
<div class="org-src-container">

<pre class="src src-sh">uwsgi --reload pid_file
</pre>
</div>
</li>
<li>use <code>stat\_server</code> for worker monitoring
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">in uwsgi.ini</span>
stats = /tmp/uwsgi_stat.sock
<span class="org-comment-delimiter"># </span><span class="org-comment">in shell</span>
$ uwsgitop /tmp/uwsgi_stat.sock
</pre>
</div>
</li>
<li>read uwsgitop output
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">WID</td>
<td class="left">worker id</td>
</tr>

<tr>
<td class="left">%</td>
<td class="left">percentage of served requests by the worker</td>
</tr>

<tr>
<td class="left">PID</td>
<td class="left">process id of the worker</td>
</tr>

<tr>
<td class="left">REQ</td>
<td class="left">number of managed requests</td>
</tr>

<tr>
<td class="left">EXC</td>
<td class="left">number of raised exceptions</td>
</tr>

<tr>
<td class="left">SIG</td>
<td class="left">number of managed uwsgi signals (NOT unix signals !!!)</td>
</tr>

<tr>
<td class="left">STATUS</td>
<td class="left">can be idle, busy, pause, cheaped or sig</td>
</tr>

<tr>
<td class="left">AVG</td>
<td class="left">average response time for the worker</td>
</tr>

<tr>
<td class="left">RSS</td>
<td class="left">RSS memory (need &#x2013;memory-report)</td>
</tr>

<tr>
<td class="left">VSZ</td>
<td class="left">address space (need &#x2013;memory-report)</td>
</tr>

<tr>
<td class="left">TX</td>
<td class="left">transmitted data</td>
</tr>

<tr>
<td class="left">RunT</td>
<td class="left">running time</td>
</tr>
</tbody>
</table>
</li>
</ul>
</li>
</ol>
</div>
</div>
